Repository: YannCharbon/DiceCombats
Catalog: DiceCombats/Resources/Localization/CreatureCustomFieldRenderer.*.resx
Languages: fr

# CBFieldAddOption
source: Add option
fr: Ajouter une option

# CBFieldShowTextFields
source: Show text fields
fr: Afficher les titres

# CBFieldTextLabels
source: Text labels
fr: Titre

# CBGridColumnLabels
source: Column labels
fr: Nom de colonne

# CBGridColumnName
source: Column name
fr: Nom de colonne

# CBGridRowLabels
source: Row labels
fr: Nom de ligne

# CBGridRowName
source: Row name
fr: Nom de ligne

# ColorPickerName
source: Basic Color Picker
fr: Sélecteur de couleurs

# CreatureStatsCount
source: Stats count
fr: Nombre de stats

# CreatureStatsKeepValuesEditable
source: Keep values editable
fr: Laisser les valeurs éditables

# CreatureStatsStatLabel
source: Stat label
fr: Nom de stat

# CustomFieldBtn
source: Custom field
fr: Champ personnalisé

# DnDConditionAddCondition
source: Add condition
fr: Ajouter un état

# DnDConditionMinimize
source: Minimize
fr: Réduire

# FieldNameLabel
source: Field name
fr: Nom du champ

source: HP
fr: PV

# MaxHPLabel
source: Max HP
fr: PV Max

# NonEditableField
source: This field cannot be edited
fr: Ce champ ne peut pas être édité

source: Option label
fr: Nom d'option

# SharedField
source: Shared
fr: Partagé

# TextGridColumnLabels
source: Column labels
fr: Nom de colonne

# TextGridColumnName
source: Column name
fr: Nom de colonne

# TextGridRowLabels
source: Row labels
fr: Nom de ligne

# TextGridRowName
source: Row name
fr: Nom de ligne

# TextGridShowLabel
source: Show label
fr: Afficher le label
