Repository: YannCharbon/DiceCombats
Catalog: DiceCombats/Resources/Localization/CreatureCustomFieldsEditor.*.resx
Languages: fr

# AddAdditionalFieldsTitle
source: Add additional fields to this creatures
fr: Ajouter des champs à cette créature

source: Add field
fr: Ajouter ce champ

# AssistanceCheckboxField
source: One or more boolean options the user can toggle. Useful for simple conditions, status effects, toggles, or flags.
fr: Une ou plusieurs option binaires que l'utilisateur peut basculer. Particulièrement utile pour gérer des états simples, des effets, des flags.

# AssistanceCheckboxField2
source: This first example illustrates a basic example
fr: Ce premier exemple illustre un exemple basique

# AssistanceCheckboxField3
source: It is possible to show an additional numeric field to store a specific value
fr: Il est possible d'afficher un champ textuel éditable pour associer la bascule avec une valeur spécifique

# AssistanceCheckboxGridField
source: A grid of checkboxes arranged in rows and columns. Ideal for tracking ammunition, charges, cooldowns, damages, or usage of limited abilities.
fr: Une grille de bascules arrangées en ligne/colonne. Idéale pour effectuer le suivi de munitions, charges, dommages, ou des facultés.

# AssistanceCheckboxGridField2
source: It is possible to add/hide rows and columns labels
fr: Il est possible d'afficher/masquer les étiquettes (labels) des lignes et/ou des colonnes

# AssistanceColorField
source: A color picker field. Use it to tag creatures visually by role, alignment, faction, or custom logic based on colour codes. Especially useful when playing with real miniature having a color base which allows to easily identify them. This will render as follows in combat mode.
fr: Un sélecteur de couleur permettant d'identifier une créature visuellement en fonction d'un rôle, d'une faction, ou toute autre logique basée sur un code couleur. Particulièrement utile lorsque l'on joue avec de véritables figurines disposant d'une base colorée permettant de l'identifier formellement sur le champ de bataille. Le rendu en mode combat ressemble à l'exemple suivant :

# AssistanceConditionsField
source: A flexible field to track states and conditions (e.g. charmed, poisoned, etc.). There are two possible views that can be switched dynamically in combat mode.
fr: Un champ flexible permettant d'effectuer le suivi des états et des conditions (p.ex. charmé, empoisonné, etc.). Il y a deux vues possibles qui peuvent être basculées en mode combat.

# AssistanceConditionsField2
source: The view can be minimized to have a summary
fr: La vue peut être réduite afin d'avoir un simple aperçu

# AssistanceFieldTitle
source: field assitance and examples
fr: : Assistance et exemples

# AssistanceGeneralExamplesDesc
source: Here are some examples of creatures using custom fields and how they render in combat mode
fr: Voici quelques exemples de créatures utilisant des champs personnalisés, et leur rendu en mode combat.

# AssistanceGeneralExamplesTitle
source: Examples
fr: Exemples

# AssistanceGeneralSharedFieldsDesc
source: Each field of the creature can be marked as <b>Shared</b>. In combat mode, you can declare a number of instances for each creature (e.g. 5 goblins). The <b>Shared</b> feature means that the field is shared between all instances and will be only rendered once. <i> For example, you probably don't want the competences of the globlins to be re-rendered for each instance of goblins, but in the other hand, you might want to track hit points individually for each instance. </i>
fr: Chaque champ d’une créature peut être marqué comme <b>Partagé</b>. En mode combat, vous pouvez déclarer un nombre d’instances pour chaque créature (par exemple, 5 gobelins). La fonctionnalité <b>Partagé</b> signifie que le champ est commun à toutes les instances et ne sera affiché qu’une seule fois. <i> Par exemple, vous ne souhaitez probablement pas que les compétences des gobelins soient réaffichées pour chaque instance, mais en revanche, vous voudrez sans doute suivre les points de vie individuellement pour chacun. </i>

# AssistanceGeneralSharedFieldsTitle
source: Shared fields
fr: Champs partagés

# AssistanceHitPointsField
source: A simple hit points tracking counter.
fr: Un simple compteur de PV

# AssistanceNumericField
source: A simple number field. Use it for values like initiative, XP, counters, or any custom numeric attribute.
fr: Un simple champ numérique pouvant être utilisé pour effectuer le suivi d'éléments tels que l'XP, l'initiative, ou n'importe quel paramètre numérique

# AssistanceStatsField
source: A set of labeled numeric values, typically representing core abilities like STR, DEX, INT, etc. Can be configured to match any stat system.
fr: Un ensemble de valeurs numérique pouvant représenter des compétences (telles que FOR, DEX, INT, etc.). Peut être configuré pour correspondre n'importe quel système de compétences.

# AssistanceStatsField2
source: Fields can remain editable in combat mode
fr: Le champ peut être laissé comme éditable en mode combat

# AssistanceTextField
source: A basic multi-line text field. Best suited for notes, conditions, reminders, or any descriptive data you want to attach to a creature.
fr: Un champ de texte multiligne basique, adapté pour prendre des notes ou définir des descriptions par rapport à la créature.

# AssistanceTextGridField
source: A table-like field with editable text cells. Useful for managing spell slots, inventory, abilities or structured notes. Optional row and column headers can be added.
fr: Un champ permettant de définir une grille de zones de texte. Adapté pour gérer des capacités, des compétences, des inventaires, des sorts, ou encore des notes structurées. Des étiquettes (labels) de lignes/colonnes peuvent être ajoutés.

# AssistanceUserCustomFieldDesc
source: You can save any field that you have customized as a template in the user custom fields.
fr: Vous pouvez enregistrer n’importe quel champ que vous avez personnalisé comme modèle dans vos champs personnalisés utilisateur. Ces modèles seront ensuite disponibles dans le sélecteur de champs. Cela est particulièrement pratique si plusieurs de vos créatures nécessitent la même fonctionnalité et/ou mise en page, car vous n’aurez pas à tout recommencer l'édition à chaque fois.

# AssistanceUserCustomFieldTitle
source: User custom fields
fr: Champs personnalisés

# AssitanceGeneral1
source: This editor allows you to enrich your creatures with custom fields tailored to your gameplay needs. You can choose from various field types such as health bars, numerical stats, checkboxes, status conditions, and more. Each field is fully configurable and will be rendered consistently in both combat and creature views. You can add multiple fields, reorder them, or remove them at any time. For each type, a visual example and short description is provided below to help you decide.
fr: Cet éditeur vous permet d’enrichir vos créatures avec des champs personnalisés adaptés à vos besoins en jeu. Vous pouvez choisir parmi différents types de champs tels que des compteurs de vie, des statistiques numériques, des cases à cocher, des états, et bien plus encore. Chaque champ est entièrement configurable et sera affiché de manière dynamique en mode combat. Vous pouvez ajouter plusieurs champs, les réorganiser ou les supprimer à tout moment. Pour chaque type, un exemple visuel et une courte description sont fournis pour vous guider.

# CustomFieldBtn
source: Custom field
fr: Champ personnalisé

# FieldRemove
source: Remove
fr: Retirer

source: Field type
fr: Type de champ

source: Move backward
fr: Déplacer en arrière

source: Move forward
fr: Déplacer en avant

# SharedField
source: Shared
fr: Partagé
