Repository: YannCharbon/DiceCombats
Catalog: DiceCombats/Resources/Localization/DetailedPopupFieldPopup.*.resx
Languages: fr

# DetailedPopupShowEditorHelp
source: Show editing help
fr: Afficher l'aide d'édition

# DetailedPopupOverviewTitle
source: Overview
fr: Vue d'ensemble

# DetailedPopupOverviewBody
source: <![CDATA[ <p> Add one or more <b>content entries</b>. Each entry has a <i>Kind</i> that defines how it renders: <span class="kbd">text</span>, <span class="kbd">markdown</span>, <span class="kbd">html (templated)</span>, or <span class="kbd">pdf</span>. Use the <i>Name</i> to group pieces visually within the popup. </p> <ul> <li><b>Search</b> filters results by group title, entry name/key, and indexed text.</li> <li><b>Grid/List</b> toggle changes the layout; grid uses a masonry layout.</li> </ul> ]]>
fr: <![CDATA[ <p> Ajoutez une ou plusieurs <b>entrées de contenu</b>. Chaque entrée possède un <i>Type</i> qui définit son rendu : <span class="kbd">text</span>, <span class="kbd">markdown</span>, <span class="kbd">html (templated)</span> ou <span class="kbd">pdf</span>. Utilisez le <i>Nom</i> pour regrouper visuellement les éléments au sein de la popup. </p> <ul> <li><b>Recherche</b> filtre les résultats par titre de groupe, nom/clé d'entrée et texte indexé.</li> <li>Le basculement <b>Grille/Liste</b> change la mise en page ; le mode grille utilise une disposition en maçonnerie.</li> </ul> ]]>

# DetailedPopupTextBody
source: <![CDATA[ <p> Use the <b>Content</b> box to write plain text. It will be rendered as simple paragraphs (with preserved line breaks) and indexed as a single block for search. </p> ]]>
fr: <![CDATA[ <p> Utilisez la zone <b>Contenu</b> pour saisir du texte brut. Il sera rendu sous forme de paragraphes simples (avec les retours à la ligne) et indexé comme un seul bloc pour la recherche. </p> ]]>

# DetailedPopupMarkdownBody
source: <![CDATA[ <p> Markdown is converted to HTML using the <b>Markdig</b> pipeline (advanced extensions enabled). The raw markdown is stored and indexed so that search works on the original text. </p> <p> This is useful for descriptions that benefit from headings, lists, emphasis, or tables while remaining easy to edit. </p> ]]>
fr: <![CDATA[ <p> Le Markdown est converti en HTML à l'aide de la bibliothèque <b>Markdig</b> (extensions avancées activées). Le markdown brut est conservé et indexé, ce qui permet à la recherche de fonctionner sur le texte d'origine. </p> <p> Idéal pour les descriptions bénéficiant de titres, listes, emphases ou tableaux, tout en restant faciles à modifier. </p> ]]>

# DetailedPopupPdfBody
source: <![CDATA[ <p> Pick a PDF file. The renderer will create <b>one piece per page</b> using <code>pdf.js</code> for visual rendering. When text extraction is possible, each page is also indexed for search. </p> <ul> <li>Large PDFs are supported; the first render may take a bit longer.</li> <li>If parsing fails, you still see the pages visually, but search on page contents is disabled.</li> </ul> ]]>
fr: <![CDATA[ <p> Sélectionnez un fichier PDF. Le moteur crée <b>un élément par page</b> en utilisant <code>pdf.js</code> pour l'affichage. Lorsque l'extraction de texte est possible, chaque page est également indexée pour la recherche. </p> <ul> <li>Les gros PDF sont supportés ; le premier affichage peut être légèrement plus long.</li> <li>En cas d'échec de l'analyse, les pages restent visibles mais la recherche sur le contenu est désactivée.</li> </ul> ]]>

# DetailedPopupHtmlHowItWorksTitle
source: html (templated) — how it works
fr: html (templated) — fonctionnement

# DetailedPopupHtmlHowItWorksBody
source: <![CDATA[ <ol> <li><b>Source</b>: choose <span class="kbd">Paste HTML</span> or <span class="kbd">Pick file</span>.</li> <li><b>selector</b>: CSS selector that matches <i>multiple</i> nodes; each match becomes one rendered piece.</li> <li><b>template</b>: Handlebars-style template that renders each matched node.</li> <li><b>map.json</b>: optional JSON mapping keys → CSS selectors evaluated within the matched node.</li> <li><b>css</b>: optional CSS injected once for the entire popup, used by your template output.</li> </ol> <p> Default variables always available: <span class="kbd">{{{html}}}</span> (inner HTML) and <span class="kbd">{{text}}</span> (inner text). </p> ]]>
fr: <![CDATA[ <ol> <li><b>Source</b> : choisissez <span class="kbd">Paste HTML</span> ou <span class="kbd">Pick file</span>.</li> <li><b>selector</b> : sélecteur CSS qui correspond à <i>plusieurs</i> nœuds ; chaque correspondance devient un élément rendu.</li> <li><b>template</b> : template de style Handlebars appliqué à chaque nœud sélectionné.</li> <li><b>map.json</b> : JSON optionnel mappant des clés → sélecteurs CSS évalués dans le nœud courant.</li> <li><b>css</b> : CSS optionnel injecté une seule fois pour la popup entière, utilisé par le template.</li> </ol> <p> Variables par défaut toujours disponibles : <span class="kbd">{{{html}}}</span> (HTML interne) et <span class="kbd">{{text}}</span> (texte interne). </p> ]]>

# DetailedPopupHtmlTipsTitle
source: html (templated) — template & map.json tips
fr: html (templated) — conseils sur template & map.json

# DetailedPopupHtmlTipsBody
source: <![CDATA[ <ul> <li><b>Triple braces</b> <span class="kbd">{{{key}}}</span> render raw HTML; <span class="kbd">{{key}}</span> is HTML-escaped.</li> <li><b>Helpers</b> like <span class="kbd">{{#if key}}</span> and <span class="kbd">{{#each list}}</span> are supported.</li> <li> <b>map.json</b>: <ul> <li>Keys become variables in the template.</li> <li><span class="kbd">rows</span> (special): when the selector returns multiple nodes, you get an array (for <span class="kbd">{{#each}}</span>).</li> <li>Shorthands: <span class="kbd">~selfHtml</span> → current node inner HTML, any other <span class="kbd">~something</span> → current node text.</li> <li>Defaults added if missing: <span class="kbd">html</span>, <span class="kbd">text</span>.</li> </ul> </li> <li><b>CSS collisions</b>: prefix your classes (e.g. <span class="kbd">dc-card</span>) to avoid clashing with global styles.</li> </ul> ]]>
fr: <![CDATA[ <ul> <li><b>Triple accolades</b> <span class="kbd">{{{key}}}</span> : rend du HTML brut ; <span class="kbd">{{key}}</span> est échappé.</li> <li><b>Helpers</b> comme <span class="kbd">{{#if key}}</span> et <span class="kbd">{{#each list}}</span> sont supportés.</li> <li> <b>map.json</b> : <ul> <li>Les clés deviennent des variables dans le template.</li> <li><span class="kbd">rows</span> (spécial) : si le sélecteur retourne plusieurs nœuds, vous obtenez un tableau (pour <span class="kbd">{{#each}}</span>).</li> <li>Raccourcis : <span class="kbd">~selfHtml</span> → HTML interne du nœud, tout autre <span class="kbd">~quelqueChose</span> → texte du nœud.</li> <li>Les champs <span class="kbd">html</span> et <span class="kbd">text</span> sont ajoutés automatiquement s'ils manquent.</li> </ul> </li> <li><b>Collisions CSS</b> : préfixez vos classes (par ex. <span class="kbd">dc-card</span>) pour éviter les conflits avec les styles globaux.</li> </ul> ]]>

# DetailedPopupHtmlQuickStartTitle
source: html (templated) — quick starter example
fr: html (templated) — exemple rapide

# DetailedPopupHtmlQuickStartBody
source: <![CDATA[ <p> A minimal end-to-end pattern to validate your pipeline (<b>selector</b> → <b>map.json</b> → <b>template</b> → <b>CSS</b>). Each element matched by the selector is turned into one rendered “piece”. </p> <ul> <li> <p><b>selector</b>: <span class="kbd">.card</span></p> <p> This selects every <span class="kbd"><div class="card">...</div></span> in your HTML. For each match, the renderer builds a data model (from <b>map.json</b>) and feeds it to the Handlebars <b>template</b>. </p> </li> <li> <p><b>template</b> (Handlebars):</p> <pre class="kbd" style="white-space:pre-wrap"> <div class="dc-card"> <h4>{{{title}}}</h4> {{#if props}}<ul>{{#each props}}<li>{{{this}}}</li>{{/each}}</ul>{{/if}} {{#if body}}<div class="dc-body">{{{body}}}</div>{{/if}} </div> </pre> <p style="margin-top:6px"> Notes: <br />• <span class="kbd">{{{title}}}</span> and <span class="kbd">{{{body}}}</span> use triple mustaches to allow HTML (unescaped). <br />• <span class="kbd">{{#if props}}…{{/if}}</span> conditionally renders a block if the array exists/non-empty. <br />• <span class="kbd">{{#each props}}…{{/each}}</span> loops over the array created by <b>map.json</b>. </p> <p style="margin-top:6px"> Handlebars reference: <a style="color:darkcyan" href="https://handlebarsjs.com/guide/" target="_blank" rel="noopener">handlebarsjs.com/guide</a> </p> </li> <li> <p><b>css</b> (inlined in the field’s “css” box):</p> <pre class="kbd" style="white-space:pre-wrap"> .dc-card{background:#2b2e3a;border:1px solid #666;border-radius:10px;padding:12px;margin:8px 0;} .dc-card h4{margin:0 0 6px 0;font-weight:800;} .dc-card ul{margin:6px 0 0 18px;padding:0;} .dc-body{margin-top:6px;line-height:1.35;} </pre> <p style="margin-top:6px"> Tip: keep CSS here, not inside the HTML input. The popup aggregates CSS from all “html (templated)” entries and injects it only once to avoid duplicates. </p> </li> <li> <p><b>map.json</b> (selectors are resolved <i>inside each matched .card</i>):</p> <pre class="kbd" style="white-space:pre-wrap"> {"title":"h3","body":".content","props":".props li"} </pre> <p style="margin-top:6px"> • <span class="kbd">"title":"h3"</span> → capture the inner HTML of the first <span class="kbd"><h3></span>.<br /> • <span class="kbd">"body":".content"</span> → capture the inner HTML of the <span class="kbd">.content</span> div.<br /> • <span class="kbd">"props":".props li"</span> → collect all list items into an array. </p> </li> <li> <p><b>raw html input</b>:</p> <pre class="kbd" style="white-space:pre-wrap"> <div class="card"> <h3>Magic Missile</h3> <ul class="props"> <li>Casting Time: 1 action</li> <li>Range: 36 m</li> </ul> <div class="content">You create three glowing darts of magical force...</div> </div> <div class="card"> <h3>Shield</h3> <ul class="props"> <li>Casting Time: 1 reaction</li> <li>Duration: 1 round</li> </ul> <div class="content">An invisible barrier of magical force appears and protects you...</div> </div> </pre> <p style="margin-top:6px"> With the selector <span class="kbd">.card</span>, this produces two pieces (one per card). If nothing renders, first verify the selector matches your HTML. </p> </li> </ul> <p> <b>How it renders:</b> each <span class="kbd"><div class="card">…</div></span> becomes one piece. The mapper picks <span class="kbd">h3</span> → <span class="kbd">{{{title}}}</span>, every <span class="kbd">.props li</span> → <span class="kbd">props</span> array, and <span class="kbd">.content</span> → <span class="kbd">{{{body}}}</span>. </p> ]]>
fr: <![CDATA[ <p> Un modèle minimal pour valider votre pipeline (<b>selector</b> → <b>map.json</b> → <b>template</b> → <b>CSS</b>). Chaque élément correspondant au sélecteur devient une “carte” rendue. </p> <ul> <li> <p><b>selector</b> : <span class="kbd">.card</span></p> <p> Sélectionne chaque <span class="kbd"><div class="card">...</div></span> de votre HTML. Pour chaque correspondance, le moteur construit un modèle de données (via <b>map.json</b>) et le passe au template Handlebars. </p> </li> <li> <p><b>template</b> (Handlebars) :</p> <pre class="kbd" style="white-space:pre-wrap"> <div class="dc-card"> <h4>{{{title}}}</h4> {{#if props}}<ul>{{#each props}}<li>{{{this}}}</li>{{/each}}</ul>{{/if}} {{#if body}}<div class="dc-body">{{{body}}}</div>{{/if}} </div> </pre> <p style="margin-top:6px"> Remarques : <br />• <span class="kbd">{{{title}}}</span> et <span class="kbd">{{{body}}}</span> autorisent le HTML non échappé. <br />• <span class="kbd">{{#if props}}…{{/if}}</span> affiche le bloc uniquement si le tableau existe et n'est pas vide. <br />• <span class="kbd">{{#each props}}…{{/each}}</span> boucle sur le tableau issu de <b>map.json</b>. </p> <p style="margin-top:6px"> Documentation Handlebars : <a style="color:darkcyan" href="https://handlebarsjs.com/guide/" target="_blank" rel="noopener">handlebarsjs.com/guide</a> </p> </li> <li> <p><b>css</b> (dans le champ “css” du contenu) :</p> <pre class="kbd" style="white-space:pre-wrap"> .dc-card{background:#2b2e3a;border:1px solid #666;border-radius:10px;padding:12px;margin:8px 0;} .dc-card h4{margin:0 0 6px 0;font-weight:800;} .dc-card ul{margin:6px 0 0 18px;padding:0;} .dc-body{margin-top:6px;line-height:1.35;} </pre> <p style="margin-top:6px"> Astuce : gardez le CSS ici plutôt que dans le HTML. La popup agrège tous les CSS des entrées “html (templated)” et les injecte une seule fois pour éviter les doublons. </p> </li> <li> <p><b>map.json</b> (sélecteurs résolus <i>dans chaque .card</i>) :</p> <pre class="kbd" style="white-space:pre-wrap"> {"title":"h3","body":".content","props":".props li"} </pre> <p style="margin-top:6px"> • <span class="kbd">"title":"h3"</span> → récupère le HTML du premier <span class="kbd"><h3></span>.<br /> • <span class="kbd">"body":".content"</span> → récupère le HTML du bloc <span class="kbd">.content</span>.<br /> • <span class="kbd">"props":".props li"</span> → collecte tous les éléments de liste dans un tableau. </p> </li> <li> <p><b>HTML brut</b> :</p> <pre class="kbd" style="white-space:pre-wrap"> <div class="card"> <h3>Magic Missile</h3> <ul class="props"> <li>Casting Time: 1 action</li> <li>Range: 36 m</li> </ul> <div class="content">You create three glowing darts of magical force...</div> </div> <div class="card"> <h3>Shield</h3> <ul class="props"> <li>Casting Time: 1 reaction</li> <li>Duration: 1 round</li> </ul> <div class="content">An invisible barrier of magical force appears and protects you...</div> </div> </pre> <p style="margin-top:6px"> Avec le sélecteur <span class="kbd">.card</span>, cela produit deux éléments (un par carte). Si rien ne s'affiche, vérifiez d'abord que le sélecteur correspond bien à votre HTML. </p> </li> </ul> <p> <b>Rendu :</b> chaque <span class="kbd"><div class="card">…</div></span> devient un élément. Le mappeur prend <span class="kbd">h3</span> → <span class="kbd">{{{title}}}</span>, chaque <span class="kbd">.props li</span> → tableau <span class="kbd">props</span>, et <span class="kbd">.content</span> → <span class="kbd">{{{body}}}</span>. </p> ]]>

# DetailedPopupTroubleshootingTitle
source: Troubleshooting
fr: Résolution de problèmes

# DetailedPopupTroubleshootingBody
source: <![CDATA[ <ul> <li><b>No cards?</b> Verify your <i>selector</i> matches elements in the provided HTML.</li> <li><b>Missing values?</b> Ensure the key exists in <i>map.json</i> and the CSS selector matches a child element.</li> <li><b>Broken layout?</b> Keep your CSS specific and avoid very generic rules.</li> <li><b>Search misses content?</b> The index comes from <span class="kbd">text</span> (or mapped fields) per piece, plus group titles and keys.</li> </ul> ]]>
fr: <![CDATA[ <ul> <li><b>Aucune carte ?</b> Vérifiez que votre <i>selector</i> correspond bien à des éléments dans le HTML fourni.</li> <li><b>Valeurs manquantes ?</b> Assurez-vous que la clé existe dans <i>map.json</i> et que le sélecteur CSS correspond à un enfant.</li> <li><b>Mise en page cassée ?</b> Gardez un CSS spécifique et évitez les règles trop génériques.</li> <li><b>Recherche incomplète ?</b> L’index provient du champ <span class="kbd">text</span> (ou des champs mappés) par élément, plus les titres de groupe et les clés.</li> </ul> ]]>

# DetailedPopupInlineHelpHtml
source: <![CDATA[ <b>html (templated)</b> entry: <ul style="margin:6px 0;"> <li>Set <span class="kbd">selector</span> to pick repeated nodes (one piece per match).</li> <li>Write a Handlebars-style <span class="kbd">template</span> using keys from <span class="kbd">map.json</span>.</li> <li>Optional <span class="kbd">css</span> applies to all pieces (injected once in the popup).</li> <li><span class="kbd">source</span>: choose <i>Paste HTML</i> or <i>Pick file</i> below.</li> </ul> ]]>
fr: <![CDATA[ Entrée <b>html (templated)</b> : <ul style="margin:6px 0;"> <li>Définissez <span class="kbd">selector</span> pour cibler des nœuds répétés (un élément par correspondance).</li> <li>Écrivez un <span class="kbd">template</span> de style Handlebars en utilisant les clés définies dans <span class="kbd">map.json</span>.</li> <li><span class="kbd">css</span> (optionnel) s’applique à tous les éléments (injecté une seule fois dans la popup).</li> <li><span class="kbd">source</span> : choisissez entre <i>Paste HTML</i> et <i>Pick file</i> ci-dessous.</li> </ul> ]]>

# DetailedPopupDeleteTooltip
source: Delete this content
fr: Supprimer ce contenu

# DetailedPopupDeleteButton
source: Delete
fr: Supprimer

# DetailedPopupContentNameLabel
source: Content name (optional)
fr: Nom du contenu (optionnel)

# DetailedPopupKindLabel
source: Kind
fr: Type

# DetailedPopupTextContentLabel
source: Content
fr: Contenu

# DetailedPopupMarkdownContentLabel
source: Markdown content
fr: Contenu markdown

# DetailedPopupHtmlSourceInlineLabel
source: Paste HTML
fr: Coller le HTML

# DetailedPopupHtmlSourceFileLabel
source: Pick file
fr: Choisir un fichier

# DetailedPopupHtmlContentLabel
source: HTML content
fr: Contenu HTML

# DetailedPopupFilePathLabel
source: File path
fr: Chemin du fichier

# DetailedPopupPickFileButton
source: Pick file
fr: Choisir un fichier

# DetailedPopupLoadedBytesCaption
source: Loaded {0} bytes
fr: {0} octets chargés

# DetailedPopupPdfInlineHelp
source: Load a PDF file. Each page becomes a searchable piece (when text extraction is possible).
fr: Chargez un fichier PDF. Chaque page devient un élément (recherchable si l'extraction de texte est possible).

# DetailedPopupSearchPlaceholder
source: Search…
fr: Chercher…

# DetailedPopupToggleGridTooltip
source: Toggle grid/list view
fr: Bascule vue grille/liste

# DetailedPopupDeleteDialogTitle
source: Delete content
fr: Supprimer le contenu

# DetailedPopupDeleteDialogMessage
source: This action cannot be undone.<br/>Do you want to delete this content?
fr: Cette action est irréversible.<br/>Voulez-vous vraiment supprimer ce contenu ?

# DetailedPopupDeleteDialogYes
source: Delete
fr: Supprimer

# DetailedPopupDeleteDialogCancel
source: Cancel
fr: Annuler

# DetailedPopupAddNewContentButton
source: Add new content
fr: Ajouter un contenu
